from langchain_openai import ChatOpenAI, OpenAI
from langchain_ollama import ChatOllama

from dotenv import load_dotenv
import enum
load_dotenv()

class SignToLang:
    __models = {"gpt-4o-mini":ChatOpenAI,
                "llama3.1:latest":ChatOllama}
    
    
    __all_rules = """
        Правило 1
        При побудові перекладу розповідного речення, що написане мовою жестів, у речення, що написане писемною мовою, в загальному спочатку відтворюється підмет, а потім присудок і додаток 

        Отже, структурна схема такого речення виглядатиме так: Sub + Pred + Obj + InObj. 

        Дієслова у формі майбутнього часу переходять у неозначену форму дієслова (інфінітив) та після них додається допоміжне слово "буду"
        Дієслова у формі минулого часу переходять у неозначену форму дієслова (інфінітив) та після них додається допоміжне слово "був"
        Дієслова у формі тепершішнього часу переходять у неозначену форму дієслова (інфінітив) та після них ніяких лопоміжних слів не додається

        Дієслова після яких стоїть слово, що позначає минулий або доконаний час (був чи завершено чи будь-яке інше слово, що позначає минулий або доконаний час) перекладається як свлово у минулому часі. Наприклад "жити був" перекладається як "жив".
        Дієслова після яких стоїть слово, що позначає майбутній  час (буду чи будь-яке інше слово, що позначає майбутній час) перекладається як свлово у майбутньому часі. Наприклад "жити буду" перекладається як "житиму".
        Дієслова, після яких не стоїть допоміжне слово, що позначає минулий чи майбутній стан узгоджуються з іншими словами в правильному відмінку.
        
        Правило 2
        У простому розповідному стверджувальному реченні спочатку відтворюється
        іменник, тоді прикметник, тобто, спочатку – “хто”, а потім  “який”. У випадку наявності двох і
        більше прикметників вони відтворюються послідовно. 
        При перекладі з УСМ УЖМ прикметник у знахідному відмінку (та у всіх інших) однини
        (множини) чоловічого (жіночого, середнього) роду переходить у форму називного відмінка однини
        (множини) (Adj(s m c4) → Adj(s)).

        Правило 3
        При побудові речення прислівники
        використовуються після тих слів, до яких вони стосуються.
        Отже, прислівники місця, часу, мети, причини, способу дії в українській мові жестів після перекладу
        на українську  мову не змінюються.

        Правило 4
        При побудові будь-якого речення, якщо в ньому присутні два слова, що позначають однину, то такі слова заміняються одним словом, що позначає множину, наприклад слова "людина людина" замінюються на одне слов "люди"

        Правило 5
        В українській мові жестів для побудови питального речення застосовують таке правило: питальні
        слова (наприклад, “як”, “коли”, “чому”, “скільки”), завжди ставляться в кінці речення.

        Правило 6
        В українській мові жестів заперечні одиниці “ні”, “не буде”, “ніколи”,
        не хочу” тощо, які є основою розповідних заперечних жестових конструкцій, застосовуються лише
        після жестів, які вони заперечують.
        Одиниці словесної, які несуть в собі заперечення, в УЖМ, при можливості, замінюються не
        відповідними, а іншими жестами. Наприклад, “не дорогий” – “дешевий”, “не весело” – “сумно”.
            Якщо “не” ставиться після певного слова, наприклад, “не мій”, то його показують як “мій + не”.
    """
    
    
    def __init__(self, model="gpt-4o-mini"):
        if model in SignToLang.__models.keys():
            self.llm: ChatOpenAI = SignToLang.__models[model](model=model)
            
        print(self.llm)
            
    def translate_sentence(self, sentence:str) -> str:
        prompt = """
        Допоможи мені перекласти речення з української жестової мови на українську мову, використовуючи приавила, що я тобі
        зараз надам у зворотньому порядку.
        Використовуй наступні правила, але лише у зворотьому порядку
        {}
        Отже, переклади це речення, що написане україньску жестовою мовою на писемну українську мову
        {}
        У відповідь надай лише перекладене речення, більше нічого
        """
        
        result = self.llm.invoke(prompt.format(self.__all_rules, sentence))
        return result.content
    
    
if __name__ == "__main__":   
    sign_to_lang = SignToLang()
    sentence_to_translate = "Сьогодні я читати завершено газету Київ"

    result = sign_to_lang.translate_sentence(sentence_to_translate)
    print(result)